node {
  name: "Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 4
        }
      }
    }
  }
}
node {
  name: "Placeholder_1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Placeholder_2"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 4
        }
      }
    }
  }
}
node {
  name: "Placeholder_3"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Supervised/truncated_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\004\000\000\000\010\000\000\000"
      }
    }
  }
}
node {
  name: "Supervised/truncated_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Supervised/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "Supervised/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "Supervised/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Supervised/truncated_normal/mul"
  op: "Mul"
  input: "Supervised/truncated_normal/TruncatedNormal"
  input: "Supervised/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/truncated_normal"
  op: "Add"
  input: "Supervised/truncated_normal/mul"
  input: "Supervised/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/Variable"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Supervised/Variable/Assign"
  op: "Assign"
  input: "Supervised/Variable"
  input: "Supervised/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Supervised/Variable"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Supervised/Variable/read"
  op: "Identity"
  input: "Supervised/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Supervised/Variable"
      }
    }
  }
}
node {
  name: "Supervised/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Supervised/Variable_1"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Supervised/Variable_1/Assign"
  op: "Assign"
  input: "Supervised/Variable_1"
  input: "Supervised/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Supervised/Variable_1"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Supervised/Variable_1/read"
  op: "Identity"
  input: "Supervised/Variable_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Supervised/Variable_1"
      }
    }
  }
}
node {
  name: "Supervised/MatMul"
  op: "MatMul"
  input: "Placeholder"
  input: "Supervised/Variable/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "Supervised/add"
  op: "Add"
  input: "Supervised/MatMul"
  input: "Supervised/Variable_1/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/Sigmoid"
  op: "Sigmoid"
  input: "Supervised/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/truncated_normal_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\010\000\000\000\010\000\000\000"
      }
    }
  }
}
node {
  name: "Supervised/truncated_normal_1/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Supervised/truncated_normal_1/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "Supervised/truncated_normal_1/TruncatedNormal"
  op: "TruncatedNormal"
  input: "Supervised/truncated_normal_1/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Supervised/truncated_normal_1/mul"
  op: "Mul"
  input: "Supervised/truncated_normal_1/TruncatedNormal"
  input: "Supervised/truncated_normal_1/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/truncated_normal_1"
  op: "Add"
  input: "Supervised/truncated_normal_1/mul"
  input: "Supervised/truncated_normal_1/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/Variable_2"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Supervised/Variable_2/Assign"
  op: "Assign"
  input: "Supervised/Variable_2"
  input: "Supervised/truncated_normal_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Supervised/Variable_2"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Supervised/Variable_2/read"
  op: "Identity"
  input: "Supervised/Variable_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Supervised/Variable_2"
      }
    }
  }
}
node {
  name: "Supervised/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Supervised/Variable_3"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Supervised/Variable_3/Assign"
  op: "Assign"
  input: "Supervised/Variable_3"
  input: "Supervised/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Supervised/Variable_3"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Supervised/Variable_3/read"
  op: "Identity"
  input: "Supervised/Variable_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Supervised/Variable_3"
      }
    }
  }
}
node {
  name: "Supervised/MatMul_1"
  op: "MatMul"
  input: "Supervised/Sigmoid"
  input: "Supervised/Variable_2/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "Supervised/add_1"
  op: "Add"
  input: "Supervised/MatMul_1"
  input: "Supervised/Variable_3/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/Sigmoid_1"
  op: "Sigmoid"
  input: "Supervised/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/truncated_normal_2/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\010\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "Supervised/truncated_normal_2/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Supervised/truncated_normal_2/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "Supervised/truncated_normal_2/TruncatedNormal"
  op: "TruncatedNormal"
  input: "Supervised/truncated_normal_2/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Supervised/truncated_normal_2/mul"
  op: "Mul"
  input: "Supervised/truncated_normal_2/TruncatedNormal"
  input: "Supervised/truncated_normal_2/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/truncated_normal_2"
  op: "Add"
  input: "Supervised/truncated_normal_2/mul"
  input: "Supervised/truncated_normal_2/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/Variable_4"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Supervised/Variable_4/Assign"
  op: "Assign"
  input: "Supervised/Variable_4"
  input: "Supervised/truncated_normal_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Supervised/Variable_4"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Supervised/Variable_4/read"
  op: "Identity"
  input: "Supervised/Variable_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Supervised/Variable_4"
      }
    }
  }
}
node {
  name: "Supervised/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Supervised/Variable_5"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Supervised/Variable_5/Assign"
  op: "Assign"
  input: "Supervised/Variable_5"
  input: "Supervised/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Supervised/Variable_5"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Supervised/Variable_5/read"
  op: "Identity"
  input: "Supervised/Variable_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Supervised/Variable_5"
      }
    }
  }
}
node {
  name: "Supervised/MatMul_2"
  op: "MatMul"
  input: "Supervised/Sigmoid_1"
  input: "Supervised/Variable_4/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "Supervised/add_2"
  op: "Add"
  input: "Supervised/MatMul_2"
  input: "Supervised/Variable_5/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/Sigmoid_2"
  op: "Sigmoid"
  input: "Supervised/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/truncated_normal_3/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\020\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "Supervised/truncated_normal_3/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Supervised/truncated_normal_3/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "Supervised/truncated_normal_3/TruncatedNormal"
  op: "TruncatedNormal"
  input: "Supervised/truncated_normal_3/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Supervised/truncated_normal_3/mul"
  op: "Mul"
  input: "Supervised/truncated_normal_3/TruncatedNormal"
  input: "Supervised/truncated_normal_3/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/truncated_normal_3"
  op: "Add"
  input: "Supervised/truncated_normal_3/mul"
  input: "Supervised/truncated_normal_3/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/Variable_6"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
        dim {
          size: 2
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Supervised/Variable_6/Assign"
  op: "Assign"
  input: "Supervised/Variable_6"
  input: "Supervised/truncated_normal_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Supervised/Variable_6"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Supervised/Variable_6/read"
  op: "Identity"
  input: "Supervised/Variable_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Supervised/Variable_6"
      }
    }
  }
}
node {
  name: "Supervised/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 2
          }
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Supervised/Variable_7"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Supervised/Variable_7/Assign"
  op: "Assign"
  input: "Supervised/Variable_7"
  input: "Supervised/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Supervised/Variable_7"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Supervised/Variable_7/read"
  op: "Identity"
  input: "Supervised/Variable_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Supervised/Variable_7"
      }
    }
  }
}
node {
  name: "Supervised/MatMul_3"
  op: "MatMul"
  input: "Supervised/Sigmoid_2"
  input: "Supervised/Variable_6/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "Supervised/add_3"
  op: "Add"
  input: "Supervised/MatMul_3"
  input: "Supervised/Variable_7/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/Sigmoid_3"
  op: "Sigmoid"
  input: "Supervised/add_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/huber_loss/Sub"
  op: "Sub"
  input: "Supervised/Sigmoid_3"
  input: "Placeholder_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/huber_loss/Abs"
  op: "Abs"
  input: "Supervised/huber_loss/Sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/huber_loss/Minimum/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/Minimum"
  op: "Minimum"
  input: "Supervised/huber_loss/Abs"
  input: "Supervised/huber_loss/Minimum/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/huber_loss/Sub_1"
  op: "Sub"
  input: "Supervised/huber_loss/Abs"
  input: "Supervised/huber_loss/Minimum"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/huber_loss/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/Mul"
  op: "Mul"
  input: "Supervised/huber_loss/Minimum"
  input: "Supervised/huber_loss/Minimum"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/huber_loss/Mul_1"
  op: "Mul"
  input: "Supervised/huber_loss/Const"
  input: "Supervised/huber_loss/Mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/huber_loss/Mul_2/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/Mul_2"
  op: "Mul"
  input: "Supervised/huber_loss/Mul_2/x"
  input: "Supervised/huber_loss/Sub_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/huber_loss/Add"
  op: "Add"
  input: "Supervised/huber_loss/Mul_1"
  input: "Supervised/huber_loss/Mul_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/huber_loss/assert_broadcastable/weights"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/assert_broadcastable/weights/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/assert_broadcastable/weights/rank"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/assert_broadcastable/values/shape"
  op: "Shape"
  input: "Supervised/huber_loss/Add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Supervised/huber_loss/assert_broadcastable/values/rank"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/assert_broadcastable/static_scalar_check_success"
  op: "NoOp"
}
node {
  name: "Supervised/huber_loss/ToFloat/x"
  op: "Const"
  input: "^Supervised/huber_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/Mul_3"
  op: "Mul"
  input: "Supervised/huber_loss/Add"
  input: "Supervised/huber_loss/ToFloat/x"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/huber_loss/Const_1"
  op: "Const"
  input: "^Supervised/huber_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/Sum"
  op: "Sum"
  input: "Supervised/huber_loss/Mul_3"
  input: "Supervised/huber_loss/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "Supervised/huber_loss/num_present/Equal/y"
  op: "Const"
  input: "^Supervised/huber_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/num_present/Equal"
  op: "Equal"
  input: "Supervised/huber_loss/ToFloat/x"
  input: "Supervised/huber_loss/num_present/Equal/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/huber_loss/num_present/zeros_like"
  op: "Const"
  input: "^Supervised/huber_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/num_present/ones_like/Shape"
  op: "Const"
  input: "^Supervised/huber_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/num_present/ones_like/Const"
  op: "Const"
  input: "^Supervised/huber_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/num_present/ones_like"
  op: "Fill"
  input: "Supervised/huber_loss/num_present/ones_like/Shape"
  input: "Supervised/huber_loss/num_present/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Supervised/huber_loss/num_present/Select"
  op: "Select"
  input: "Supervised/huber_loss/num_present/Equal"
  input: "Supervised/huber_loss/num_present/zeros_like"
  input: "Supervised/huber_loss/num_present/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/huber_loss/num_present/broadcast_weights/assert_broadcastable/weights/shape"
  op: "Const"
  input: "^Supervised/huber_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/num_present/broadcast_weights/assert_broadcastable/weights/rank"
  op: "Const"
  input: "^Supervised/huber_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/num_present/broadcast_weights/assert_broadcastable/values/shape"
  op: "Shape"
  input: "Supervised/huber_loss/Add"
  input: "^Supervised/huber_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Supervised/huber_loss/num_present/broadcast_weights/assert_broadcastable/values/rank"
  op: "Const"
  input: "^Supervised/huber_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/num_present/broadcast_weights/assert_broadcastable/static_scalar_check_success"
  op: "NoOp"
  input: "^Supervised/huber_loss/assert_broadcastable/static_scalar_check_success"
}
node {
  name: "Supervised/huber_loss/num_present/broadcast_weights/ones_like/Shape"
  op: "Shape"
  input: "Supervised/huber_loss/Add"
  input: "^Supervised/huber_loss/assert_broadcastable/static_scalar_check_success"
  input: "^Supervised/huber_loss/num_present/broadcast_weights/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Supervised/huber_loss/num_present/broadcast_weights/ones_like/Const"
  op: "Const"
  input: "^Supervised/huber_loss/assert_broadcastable/static_scalar_check_success"
  input: "^Supervised/huber_loss/num_present/broadcast_weights/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/num_present/broadcast_weights/ones_like"
  op: "Fill"
  input: "Supervised/huber_loss/num_present/broadcast_weights/ones_like/Shape"
  input: "Supervised/huber_loss/num_present/broadcast_weights/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Supervised/huber_loss/num_present/broadcast_weights"
  op: "Mul"
  input: "Supervised/huber_loss/num_present/Select"
  input: "Supervised/huber_loss/num_present/broadcast_weights/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/huber_loss/num_present/Const"
  op: "Const"
  input: "^Supervised/huber_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/num_present"
  op: "Sum"
  input: "Supervised/huber_loss/num_present/broadcast_weights"
  input: "Supervised/huber_loss/num_present/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "Supervised/huber_loss/Const_2"
  op: "Const"
  input: "^Supervised/huber_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/Sum_1"
  op: "Sum"
  input: "Supervised/huber_loss/Sum"
  input: "Supervised/huber_loss/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "Supervised/huber_loss/Greater/y"
  op: "Const"
  input: "^Supervised/huber_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/Greater"
  op: "Greater"
  input: "Supervised/huber_loss/num_present"
  input: "Supervised/huber_loss/Greater/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/huber_loss/Equal/y"
  op: "Const"
  input: "^Supervised/huber_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/Equal"
  op: "Equal"
  input: "Supervised/huber_loss/num_present"
  input: "Supervised/huber_loss/Equal/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/huber_loss/ones_like/Shape"
  op: "Const"
  input: "^Supervised/huber_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/ones_like/Const"
  op: "Const"
  input: "^Supervised/huber_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/ones_like"
  op: "Fill"
  input: "Supervised/huber_loss/ones_like/Shape"
  input: "Supervised/huber_loss/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Supervised/huber_loss/Select"
  op: "Select"
  input: "Supervised/huber_loss/Equal"
  input: "Supervised/huber_loss/ones_like"
  input: "Supervised/huber_loss/num_present"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/huber_loss/div"
  op: "RealDiv"
  input: "Supervised/huber_loss/Sum_1"
  input: "Supervised/huber_loss/Select"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/huber_loss/zeros_like"
  op: "Const"
  input: "^Supervised/huber_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Supervised/huber_loss/value"
  op: "Select"
  input: "Supervised/huber_loss/Greater"
  input: "Supervised/huber_loss/div"
  input: "Supervised/huber_loss/zeros_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/gradients/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "Supervised/gradients/grad_ys_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Supervised/gradients/Fill"
  op: "Fill"
  input: "Supervised/gradients/Shape"
  input: "Supervised/gradients/grad_ys_0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/value_grad/zeros_like"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/value_grad/Select"
  op: "Select"
  input: "Supervised/huber_loss/Greater"
  input: "Supervised/gradients/Fill"
  input: "Supervised/gradients/Supervised/huber_loss/value_grad/zeros_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/value_grad/Select_1"
  op: "Select"
  input: "Supervised/huber_loss/Greater"
  input: "Supervised/gradients/Supervised/huber_loss/value_grad/zeros_like"
  input: "Supervised/gradients/Fill"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/value_grad/tuple/group_deps"
  op: "NoOp"
  input: "^Supervised/gradients/Supervised/huber_loss/value_grad/Select"
  input: "^Supervised/gradients/Supervised/huber_loss/value_grad/Select_1"
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/value_grad/tuple/control_dependency"
  op: "Identity"
  input: "Supervised/gradients/Supervised/huber_loss/value_grad/Select"
  input: "^Supervised/gradients/Supervised/huber_loss/value_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Supervised/gradients/Supervised/huber_loss/value_grad/Select"
      }
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/value_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "Supervised/gradients/Supervised/huber_loss/value_grad/Select_1"
  input: "^Supervised/gradients/Supervised/huber_loss/value_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Supervised/gradients/Supervised/huber_loss/value_grad/Select_1"
      }
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/div_grad/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/div_grad/Shape_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/div_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "Supervised/gradients/Supervised/huber_loss/div_grad/Shape"
  input: "Supervised/gradients/Supervised/huber_loss/div_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/div_grad/RealDiv"
  op: "RealDiv"
  input: "Supervised/gradients/Supervised/huber_loss/value_grad/tuple/control_dependency"
  input: "Supervised/huber_loss/Select"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/div_grad/Sum"
  op: "Sum"
  input: "Supervised/gradients/Supervised/huber_loss/div_grad/RealDiv"
  input: "Supervised/gradients/Supervised/huber_loss/div_grad/BroadcastGradientArgs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/div_grad/Reshape"
  op: "Reshape"
  input: "Supervised/gradients/Supervised/huber_loss/div_grad/Sum"
  input: "Supervised/gradients/Supervised/huber_loss/div_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/div_grad/Neg"
  op: "Neg"
  input: "Supervised/huber_loss/Sum_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/div_grad/RealDiv_1"
  op: "RealDiv"
  input: "Supervised/gradients/Supervised/huber_loss/div_grad/Neg"
  input: "Supervised/huber_loss/Select"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/div_grad/RealDiv_2"
  op: "RealDiv"
  input: "Supervised/gradients/Supervised/huber_loss/div_grad/RealDiv_1"
  input: "Supervised/huber_loss/Select"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/div_grad/mul"
  op: "Mul"
  input: "Supervised/gradients/Supervised/huber_loss/value_grad/tuple/control_dependency"
  input: "Supervised/gradients/Supervised/huber_loss/div_grad/RealDiv_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/div_grad/Sum_1"
  op: "Sum"
  input: "Supervised/gradients/Supervised/huber_loss/div_grad/mul"
  input: "Supervised/gradients/Supervised/huber_loss/div_grad/BroadcastGradientArgs:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/div_grad/Reshape_1"
  op: "Reshape"
  input: "Supervised/gradients/Supervised/huber_loss/div_grad/Sum_1"
  input: "Supervised/gradients/Supervised/huber_loss/div_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/div_grad/tuple/group_deps"
  op: "NoOp"
  input: "^Supervised/gradients/Supervised/huber_loss/div_grad/Reshape"
  input: "^Supervised/gradients/Supervised/huber_loss/div_grad/Reshape_1"
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/div_grad/tuple/control_dependency"
  op: "Identity"
  input: "Supervised/gradients/Supervised/huber_loss/div_grad/Reshape"
  input: "^Supervised/gradients/Supervised/huber_loss/div_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Supervised/gradients/Supervised/huber_loss/div_grad/Reshape"
      }
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/div_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "Supervised/gradients/Supervised/huber_loss/div_grad/Reshape_1"
  input: "^Supervised/gradients/Supervised/huber_loss/div_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Supervised/gradients/Supervised/huber_loss/div_grad/Reshape_1"
      }
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/Sum_1_grad/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/Sum_1_grad/Reshape"
  op: "Reshape"
  input: "Supervised/gradients/Supervised/huber_loss/div_grad/tuple/control_dependency"
  input: "Supervised/gradients/Supervised/huber_loss/Sum_1_grad/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/Sum_1_grad/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/Sum_1_grad/Tile"
  op: "Tile"
  input: "Supervised/gradients/Supervised/huber_loss/Sum_1_grad/Reshape"
  input: "Supervised/gradients/Supervised/huber_loss/Sum_1_grad/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/Sum_grad/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/Sum_grad/Reshape"
  op: "Reshape"
  input: "Supervised/gradients/Supervised/huber_loss/Sum_1_grad/Tile"
  input: "Supervised/gradients/Supervised/huber_loss/Sum_grad/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/Sum_grad/Shape"
  op: "Shape"
  input: "Supervised/huber_loss/Mul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/Sum_grad/Tile"
  op: "Tile"
  input: "Supervised/gradients/Supervised/huber_loss/Sum_grad/Reshape"
  input: "Supervised/gradients/Supervised/huber_loss/Sum_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/Mul_3_grad/Shape"
  op: "Shape"
  input: "Supervised/huber_loss/Add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/Mul_3_grad/Shape_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/Mul_3_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "Supervised/gradients/Supervised/huber_loss/Mul_3_grad/Shape"
  input: "Supervised/gradients/Supervised/huber_loss/Mul_3_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/Mul_3_grad/Mul"
  op: "Mul"
  input: "Supervised/gradients/Supervised/huber_loss/Sum_grad/Tile"
  input: "Supervised/huber_loss/ToFloat/x"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/Mul_3_grad/Sum"
  op: "Sum"
  input: "Supervised/gradients/Supervised/huber_loss/Mul_3_grad/Mul"
  input: "Supervised/gradients/Supervised/huber_loss/Mul_3_grad/BroadcastGradientArgs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "Supervised/gradients/Supervised/huber_loss/Mul_3_grad/Reshape"
  op: "Reshape"
  input: "Supervised/gradients/Supervised/huber_loss/Mul_3_grad/Sum"
